{"guide": {"name": "sharing-your-app", "category": "getting-started", "pretty_category": "Getting Started", "guide_index": 3, "absolute_index": 2, "pretty_name": "Sharing Your App", "content": "# Sharing Your App\n\nHow to share your Gradio app: \n\n1. [Sharing demos with the share parameter](#sharing-demos)\n2. [Hosting on HF Spaces](#hosting-on-hf-spaces)\n3. [Embedding hosted spaces](#embedding-hosted-spaces)\n4. [Embedding with web components](#embedding-with-web-components)\n5. [Using the API page](#api-page)\n6. [Adding authentication to the page](#authentication)\n7. [Accessing Network Requests](#accessing-the-network-request-directly)\n8. [Mounting within FastAPI](#mounting-within-another-fast-api-app)\n9. [Security](#security-and-file-access)\n\n## Sharing Demos\n\nGradio demos can be easily shared publicly by setting `share=True` in the `launch()` method. Like this:\n\n```python\ndemo.launch(share=True)\n```\n\nThis generates a public, shareable link that you can send to anybody! When you send this link, the user on the other side can try out the model in their browser. Because the processing happens on your device (as long as your device stays on!), you don't have to worry about any packaging any dependencies. A share link usually looks something like this:  **XXXXX.gradio.app**. Although the link is served through a Gradio URL, we are only a proxy for your local server, and do not store any data sent through your app.\n\nKeep in mind, however, that these links are publicly accessible, meaning that anyone can use your model for prediction! Therefore, make sure not to expose any sensitive information through the functions you write, or allow any critical changes to occur on your device. If you set `share=False` (the default, except in colab notebooks), only a local link is created, which can be shared by  [port-forwarding](https://www.ssh.com/ssh/tunneling/example)  with specific users. \n\n![sharing](https://github.com/gradio-app/gradio/blob/main/guides/assets/sharing.svg?raw=true)\n\nShare links expire after 72 hours.\n\n## Hosting on HF Spaces\n\nIf you'd like to have a permanent link to your Gradio demo on the internet, use Hugging Face Spaces. [Hugging Face Spaces](http://huggingface.co/spaces/) provides the infrastructure to permanently host your machine learning model for free! \n\nAfter you have [created a free Hugging Face account](https://huggingface.co/join), you have three methods to deploy your Gradio app to Hugging Face Spaces:\n1. From terminal: run `gradio deploy` in your app directory. The CLI will gather some basic metadata and then launch your app. To update your space, you can re-run this command or enable the Github Actions option to automatically update the Spaces on `git push`.\n2. From your browser: Drag and drop a folder containing your Gradio model and all related files [here](https://huggingface.co/new-space).\n3. Connect Spaces with your Git repository and Spaces will pull the Gradio app from there. See [this guide how to host on Hugging Face Spaces](https://huggingface.co/blog/gradio-spaces) for more information. \n\n<video autoplay muted loop>\n  <source src=\"https://github.com/gradio-app/gradio/blob/main/guides/assets/hf_demo.mp4?raw=true\" type=\"video/mp4\" />\n</video>\n\n## Embedding Hosted Spaces\n\nOnce you have hosted your app on Hugging Face Spaces (or on your own server), you may want to embed the demo on a different website, such as your blog or your portfolio. Embedding an interactive demo allows people to try out the machine learning model that you have built, without needing to download or install anything — right in their browser! The best part is that you can embed interactive demos even in static websites, such as GitHub pages.\n\nThere are two ways to embed your Gradio demos. You can find quick links to both options directly on the Hugging Face Space page, in the \"Embed this Space\" dropdown option:\n\n![Embed this Space dropdown option](https://github.com/gradio-app/gradio/blob/main/guides/assets/embed_this_space.png?raw=true)\n\n### Embedding with Web Components\n\nWeb components typically offer a better experience to users than IFrames. Web components load lazily, meaning that they won't slow down the loading time of your website, and they automatically adjust their height based on the size of the Gradio app. \n\nTo embed with Web Components:\n\n1. Import the gradio JS library into into your site by adding the script below in your site (replace {GRADIO_VERSION} in the URL with the library version of Gradio you are using). \n\n```html\n<script type=\"module\"\nsrc=\"https://gradio.s3-us-west-2.amazonaws.com/{GRADIO_VERSION}/gradio.js\">\n</script>\n```\n\n2. Add \n```html\n<gradio-app src=\"https://$your_space_host.hf.space\"></gradio-app>\n```\n\nelement where you want to place the app. Set the `src=` attribute to your Space's embed URL, which you can find in the \"Embed this Space\" button. For example:\n\n\n```html\n<gradio-app src=\"https://abidlabs-pytorch-image-classifier.hf.space\"></gradio-app>\n```\n\n<script>\nfetch(\"https://pypi.org/pypi/gradio/json\"\n).then(r => r.json()\n).then(obj => {\n    let v = obj.info.version;\n    content = document.querySelector('.prose');\n    content.innerHTML = content.innerHTML.replaceAll(\"{GRADIO_VERSION}\", v);\n});\n</script>\n\nYou can see examples of how web components look <a href=\"https://www.gradio.app\">on the Gradio landing page</a>.\n\nYou can also customize the appearance and behavior of your web component with attributes that you pass into the `<gradio-app>` tag:\n\n* `src`: as we've seen, the `src` attributes links to the URL of the hosted Gradio demo that you would like to embed\n* `space`: an optional shorthand if your Gradio demo is hosted on Hugging Face Space. Accepts a `username/space_name` instead of a full URL. Example: `gradio/Echocardiogram-Segmentation`. If this attribute attribute is provided, then `src` does not need to be provided.\n* `control_page_title`: a boolean designating whether the html title of the page should be set to the title of the Gradio app (by default `\"false\"`)\n* `initial_height`: the initial height of the web component while it is loading the Gradio app, (by default `\"300px\"`). Note that the final height is set based on the size of the Gradio app.\n* `container`: whether to show the border frame and information about where the Space is hosted (by default `\"true\"`)\n* `info`: whether to show just the information about where the Space is hosted underneath the embedded app (by default `\"true\"`)\n* `autoscroll`: whether to autoscroll to the output when prediction has finished (by default `\"false\"`)\n* `eager`: whether to load the Gradio app as soon as the page loads (by default `\"false\"`)\n* `theme_mode`: whether to use the `dark`, `light`, or default `system` theme mode (by default `\"system\"`)\n\nHere's an example of how to use these attributes to create a Gradio app that does not lazy load and has an initial height of 0px. \n\n```html\n<gradio-app space=\"gradio/Echocardiogram-Segmentation\" eager=\"true\" \ninitial_height=\"0px\"></gradio-app>\n```\n\n_Note: While Gradio's CSS will never impact the embedding page, the embedding page can affect the style of the embedded Gradio app. Make sure that any CSS in the parent page isn't so general that it could also apply to the embedded Gradio app and cause the styling to break. Element selectors such as `header { ... }` and `footer { ... }` will be the most likely to cause issues._\n\n### Embedding with IFrames\n\nTo embed with IFrames instead (if you cannot add javascript to your website, for example), add this element:\n\n```html\n<iframe src=\"https://$your_space_host.hf.space\"></iframe>\n```\n\nAgain, you can find the `src=` attribute to your Space's embed URL, which you can find in the \"Embed this Space\" button.\n\nNote: if you use IFrames, you'll probably want to add a fixed `height` attribute and set `style=\"border:0;\"` to remove the boreder. In addition, if your app requires permissions such as access to the webcam or the microphone, you'll need to provide that as well using the `allow` attribute.\n\n## API Page\n\nYou can use almost any Gradio app as an API! In the footer of a Gradio app [like this one](https://huggingface.co/spaces/gradio/hello_world), you'll see a \"Use via API\" link.  \n\n![Use via API](https://huggingface.co/datasets/huggingface/documentation-images/resolve/main/gradio-guides/api3.gif)\n\nThis is a page that lists the endpoints that can be used to query the Gradio app, via our supported clients: either [the Python client](https://gradio.app/guides/getting-started-with-the-python-client/), or [the JavaScript client](https://gradio.app/guides/getting-started-with-the-js-client/). For each endpoint, Gradio automatically generates the parameters and their types, as well as example inputs.\n\nThe endpoints are automatically created when you launch a Gradio `Interface`. If you are using Gradio `Blocks`, you can also set up a Gradio API page, though we recommend that you explicitly name each event listener, such as\n\n```python\nbtn.click(add, [num1, num2], output, api_name=\"addition\")\n```\n\nThis will add and document the endpoint `/api/addition/` to the automatically generated API page. Otherwise, your API endpoints will appear as \"unnamed\" endpoints. \n\n*Note*: For Gradio apps in which [queueing is enabled](https://gradio.app/guides/key-features#queuing), users can bypass the queue if they make a POST request to your API endpoint. To disable this behavior, set `api_open=False` in the `queue()` method. To disable the API page altogether, set `show_api=False` in `.launch()`.\n\n## Authentication\n\nYou may wish to put an authentication page in front of your app to limit who can open your app. With the `auth=` keyword argument in the `launch()` method, you can provide a tuple with a username and password, or a  list of acceptable username/password tuples;  Here's an example that provides password-based authentication for a single user named \"admin\":\n\n```python\ndemo.launch(auth=(\"admin\", \"pass1234\"))\n```\n\nFor more complex authentication handling, you can even pass a function that takes a username and password as arguments, and returns True to allow authentication, False otherwise. This can be used for, among other things, making requests to 3rd-party authentication services.\n\nHere's an example of a function that accepts any login where the username and password are the same:\n\n```python\ndef same_auth(username, password):\n    return username == password\ndemo.launch(auth=same_auth)\n```\n\nFor authentication to work properly, third party cookies must be enabled in your browser.\nThis is not the case by default for Safari, Chrome Incognito Mode.\n\n## Accessing the Network Request Directly\n\nWhen a user makes a prediction to your app, you may need the underlying network request, in order to get the request headers (e.g. for advanced authentication), log the client's IP address, or for other reasons. Gradio supports this in a similar manner to FastAPI: simply add a function parameter whose type hint is `gr.Request` and Gradio will pass in the network request as that parameter. Here is an example:\n\n```python\nimport gradio as gr\n\ndef echo(name, request: gr.Request):\n    if request:\n        print(\"Request headers dictionary:\", request.headers)\n        print(\"IP address:\", request.client.host)\n    return name\n\nio = gr.Interface(echo, \"textbox\", \"textbox\").launch()\n```\n\nNote: if your function is called directly instead of through the UI (this happens, for \nexample, when examples are cached), then `request` will be `None`. You should handle\nthis case explicitly to ensure that your app does not throw any errors. That is why\nwe have the explicit check `if request`.\n\n## Mounting Within Another FastAPI App\n\nIn some cases, you might have an existing FastAPI app, and you'd like to add a path for a Gradio demo.\nYou can easily do this with `gradio.mount_gradio_app()`.\n\nHere's a complete example:\n\n```python\nfrom fastapi import FastAPI\nimport gradio as gr\n\nCUSTOM_PATH = \"/gradio\"\n\napp = FastAPI()\n\n\n@app.get(\"/\")\ndef read_main():\n    return {\"message\": \"This is your main app\"}\n\n\nio = gr.Interface(lambda x: \"Hello, \" + x + \"!\", \"textbox\", \"textbox\")\napp = gr.mount_gradio_app(app, io, path=CUSTOM_PATH)\n\n\n# Run this from the terminal as you would normally start a FastAPI app: `uvicorn run:app`\n# and navigate to http://localhost:8000/gradio in your browser.\n\n```\n\nNote that this approach also allows you run your Gradio apps on custom paths (`http://localhost:8000/gradio` in the example above).\n\n## Security and File Access\n\nSharing your Gradio app with others (by hosting it on Spaces, on your own server, or through temporary share links) **exposes** certain files on the host machine to users of your Gradio app. \n\nIn particular, Gradio apps ALLOW users to access to three kinds of files:\n\n* **Files in the same directory (or a subdirectory) of where the Gradio script is launched from.** For example, if the path to your gradio scripts is `/home/usr/scripts/project/app.py` and you launch it from `/home/usr/scripts/project/`, then users of your shared Gradio app will be able to access any files inside `/home/usr/scripts/project/`. This is done so that you can easily reference these files in your Gradio app (e.g. for your app's `examples`).\n\n* **Temporary files created by Gradio.** These are files that are created by Gradio as part of running your prediction function. For example, if your prediction function returns a video file, then Gradio will save that video to a temporary file and then send the path to the temporary file to the front end. You can customize the location of temporary files created by Gradio by setting the environment variable `GRADIO_TEMP_DIR` to an absolute path, such as `/home/usr/scripts/project/temp/`.\n\n* **Files that you explicitly allow via the `allowed_paths` parameter in `launch()`**. This parameter  allows you to pass in a list of additional directories or exact filepaths you'd like to allow users to have access to. (By default, this parameter is an empty list).\n\nGradio DOES NOT ALLOW access to:\n\n* **Dotfiles** (any files whose name begins with `'.'`) or any files that are contained in any directory whose name begins with `'.'`\n\n* **Files that you explicitly allow via the `blocked_paths` parameter in `launch()`**. You can pass in a list of additional directories or exact filepaths to the `blocked_paths` parameter in `launch()`. This parameter takes precedence over the files that Gradio exposes by default or by the `allowed_paths`.\n\n* **Any other paths on the host machine**. Users should NOT be able to access other arbitrary paths on the host. \n\nPlease make sure you are running the latest version of `gradio` for these security settings to apply. ", "html": "<h1 id=\"sharing-your-app\">Sharing Your App</h1>\n\n<p>How to share your Gradio app: </p>\n\n<ol>\n<li><a href=\"#sharing-demos\">Sharing demos with the share parameter</a></li>\n<li><a href=\"#hosting-on-hf-spaces\">Hosting on HF Spaces</a></li>\n<li><a href=\"#embedding-hosted-spaces\">Embedding hosted spaces</a></li>\n<li><a href=\"#embedding-with-web-components\">Embedding with web components</a></li>\n<li><a href=\"#api-page\">Using the API page</a></li>\n<li><a href=\"#authentication\">Adding authentication to the page</a></li>\n<li><a href=\"#accessing-the-network-request-directly\">Accessing Network Requests</a></li>\n<li><a href=\"#mounting-within-another-fast-api-app\">Mounting within FastAPI</a></li>\n<li><a href=\"#security-and-file-access\">Security</a></li>\n</ol>\n\n<h2 id=\"sharing-demos\">Sharing Demos</h2>\n\n<p>Gradio demos can be easily shared publicly by setting <code>share=True</code> in the <code>launch()</code> method. Like this:</p>\n\n<div class='codeblock'><pre><code class='lang-python'>demo.launch(share=True)\n</code></pre></div>\n\n<p>This generates a public, shareable link that you can send to anybody! When you send this link, the user on the other side can try out the model in their browser. Because the processing happens on your device (as long as your device stays on!), you don't have to worry about any packaging any dependencies. A share link usually looks something like this:  <strong>XXXXX.gradio.app</strong>. Although the link is served through a Gradio URL, we are only a proxy for your local server, and do not store any data sent through your app.</p>\n\n<p>Keep in mind, however, that these links are publicly accessible, meaning that anyone can use your model for prediction! Therefore, make sure not to expose any sensitive information through the functions you write, or allow any critical changes to occur on your device. If you set <code>share=False</code> (the default, except in colab notebooks), only a local link is created, which can be shared by  <a rel=\"noopener\" target=\"_blank\" href=\"https://www.ssh.com/ssh/tunneling/example\">port-forwarding</a>  with specific users. </p>\n\n<p><img src=\"https://github.com/gradio-app/gradio/blob/main/guides/assets/sharing.svg?raw=true\" alt=\"sharing\" /></p>\n\n<p>Share links expire after 72 hours.</p>\n\n<h2 id=\"hosting-on-hf-spaces\">Hosting on HF Spaces</h2>\n\n<p>If you'd like to have a permanent link to your Gradio demo on the internet, use Hugging Face Spaces. <a rel=\"noopener\" target=\"_blank\" href=\"http://huggingface.co/spaces/\">Hugging Face Spaces</a> provides the infrastructure to permanently host your machine learning model for free! </p>\n\n<p>After you have <a rel=\"noopener\" target=\"_blank\" href=\"https://huggingface.co/join\">created a free Hugging Face account</a>, you have three methods to deploy your Gradio app to Hugging Face Spaces:\n1. From terminal: run <code>gradio deploy</code> in your app directory. The CLI will gather some basic metadata and then launch your app. To update your space, you can re-run this command or enable the Github Actions option to automatically update the Spaces on <code>git push</code>.\n2. From your browser: Drag and drop a folder containing your Gradio model and all related files <a rel=\"noopener\" target=\"_blank\" href=\"https://huggingface.co/new-space\">here</a>.\n3. Connect Spaces with your Git repository and Spaces will pull the Gradio app from there. See <a rel=\"noopener\" target=\"_blank\" href=\"https://huggingface.co/blog/gradio-spaces\">this guide how to host on Hugging Face Spaces</a> for more information. </p>\n\n<p><video autoplay muted loop>\n  <source src=\"https://github.com/gradio-app/gradio/blob/main/guides/assets/hf_demo.mp4?raw=true\" type=\"video/mp4\" />\n</video></p>\n\n<h2 id=\"embedding-hosted-spaces\">Embedding Hosted Spaces</h2>\n\n<p>Once you have hosted your app on Hugging Face Spaces (or on your own server), you may want to embed the demo on a different website, such as your blog or your portfolio. Embedding an interactive demo allows people to try out the machine learning model that you have built, without needing to download or install anything — right in their browser! The best part is that you can embed interactive demos even in static websites, such as GitHub pages.</p>\n\n<p>There are two ways to embed your Gradio demos. You can find quick links to both options directly on the Hugging Face Space page, in the \"Embed this Space\" dropdown option:</p>\n\n<p><img src=\"https://github.com/gradio-app/gradio/blob/main/guides/assets/embed_this_space.png?raw=true\" alt=\"Embed this Space dropdown option\" /></p>\n\n<h3 id=\"embedding-with-web-components\">Embedding with Web Components</h3>\n\n<p>Web components typically offer a better experience to users than IFrames. Web components load lazily, meaning that they won't slow down the loading time of your website, and they automatically adjust their height based on the size of the Gradio app. </p>\n\n<p>To embed with Web Components:</p>\n\n<ol>\n<li>Import the gradio JS library into into your site by adding the script below in your site (replace {GRADIO_VERSION} in the URL with the library version of Gradio you are using). </li>\n</ol>\n\n<div class='codeblock'><pre><code class='lang-html'><script type=\"module\"\nsrc=\"https://gradio.s3-us-west-2.amazonaws.com/{GRADIO_VERSION}/gradio.js\">\n</script>\n</code></pre></div>\n\n<ol>\n<li>Add </li>\n</ol>\n\n<div class='codeblock'><pre><code class='lang-html'><gradio-app src=\"https://$your_space_host.hf.space\"></gradio-app>\n</code></pre></div>\n\n<p>element where you want to place the app. Set the <code>src=</code> attribute to your Space's embed URL, which you can find in the \"Embed this Space\" button. For example:</p>\n\n<div class='codeblock'><pre><code class='lang-html'><gradio-app src=\"https://abidlabs-pytorch-image-classifier.hf.space\"></gradio-app>\n</code></pre></div>\n\n<script>\nfetch(\"https://pypi.org/pypi/gradio/json\"\n).then(r => r.json()\n).then(obj => {\n    let v = obj.info.version;\n    content = document.querySelector('.prose');\n    content.innerHTML = content.innerHTML.replaceAll(\"{GRADIO_VERSION}\", v);\n});\n</script>\n\n<p>You can see examples of how web components look <a rel=\"noopener\" target=\"_blank\" href=\"https://www.gradio.app\">on the Gradio landing page</a>.</p>\n\n<p>You can also customize the appearance and behavior of your web component with attributes that you pass into the <code>&lt;gradio-app&gt;</code> tag:</p>\n\n<ul>\n<li><code>src</code>: as we've seen, the <code>src</code> attributes links to the URL of the hosted Gradio demo that you would like to embed</li>\n<li><code>space</code>: an optional shorthand if your Gradio demo is hosted on Hugging Face Space. Accepts a <code>username/space_name</code> instead of a full URL. Example: <code>gradio/Echocardiogram-Segmentation</code>. If this attribute attribute is provided, then <code>src</code> does not need to be provided.</li>\n<li><code>control_page_title</code>: a boolean designating whether the html title of the page should be set to the title of the Gradio app (by default <code>\"false\"</code>)</li>\n<li><code>initial_height</code>: the initial height of the web component while it is loading the Gradio app, (by default <code>\"300px\"</code>). Note that the final height is set based on the size of the Gradio app.</li>\n<li><code>container</code>: whether to show the border frame and information about where the Space is hosted (by default <code>\"true\"</code>)</li>\n<li><code>info</code>: whether to show just the information about where the Space is hosted underneath the embedded app (by default <code>\"true\"</code>)</li>\n<li><code>autoscroll</code>: whether to autoscroll to the output when prediction has finished (by default <code>\"false\"</code>)</li>\n<li><code>eager</code>: whether to load the Gradio app as soon as the page loads (by default <code>\"false\"</code>)</li>\n<li><code>theme_mode</code>: whether to use the <code>dark</code>, <code>light</code>, or default <code>system</code> theme mode (by default <code>\"system\"</code>)</li>\n</ul>\n\n<p>Here's an example of how to use these attributes to create a Gradio app that does not lazy load and has an initial height of 0px. </p>\n\n<div class='codeblock'><pre><code class='lang-html'><gradio-app space=\"gradio/Echocardiogram-Segmentation\" eager=\"true\" \ninitial_height=\"0px\"></gradio-app>\n</code></pre></div>\n\n<p><em>Note: While Gradio's CSS will never impact the embedding page, the embedding page can affect the style of the embedded Gradio app. Make sure that any CSS in the parent page isn't so general that it could also apply to the embedded Gradio app and cause the styling to break. Element selectors such as <code>header { ... }</code> and <code>footer { ... }</code> will be the most likely to cause issues.</em></p>\n\n<h3 id=\"embedding-with-iframes\">Embedding with IFrames</h3>\n\n<p>To embed with IFrames instead (if you cannot add javascript to your website, for example), add this element:</p>\n\n<div class='codeblock'><pre><code class='lang-html'><iframe src=\"https://$your_space_host.hf.space\"></iframe>\n</code></pre></div>\n\n<p>Again, you can find the <code>src=</code> attribute to your Space's embed URL, which you can find in the \"Embed this Space\" button.</p>\n\n<p>Note: if you use IFrames, you'll probably want to add a fixed <code>height</code> attribute and set <code>style=\"border:0;\"</code> to remove the boreder. In addition, if your app requires permissions such as access to the webcam or the microphone, you'll need to provide that as well using the <code>allow</code> attribute.</p>\n\n<h2 id=\"api-page\">API Page</h2>\n\n<p>You can use almost any Gradio app as an API! In the footer of a Gradio app <a rel=\"noopener\" target=\"_blank\" href=\"https://huggingface.co/spaces/gradio/hello_world\">like this one</a>, you'll see a \"Use via API\" link.  </p>\n\n<p><img src=\"https://huggingface.co/datasets/huggingface/documentation-images/resolve/main/gradio-guides/api3.gif\" alt=\"Use via API\" /></p>\n\n<p>This is a page that lists the endpoints that can be used to query the Gradio app, via our supported clients: either <a rel=\"noopener\" target=\"_blank\" href=\"https://gradio.app/guides/getting-started-with-the-python-client/\">the Python client</a>, or <a rel=\"noopener\" target=\"_blank\" href=\"https://gradio.app/guides/getting-started-with-the-js-client/\">the JavaScript client</a>. For each endpoint, Gradio automatically generates the parameters and their types, as well as example inputs.</p>\n\n<p>The endpoints are automatically created when you launch a Gradio <code>Interface</code>. If you are using Gradio <code>Blocks</code>, you can also set up a Gradio API page, though we recommend that you explicitly name each event listener, such as</p>\n\n<div class='codeblock'><pre><code class='lang-python'>btn.click(add, [num1, num2], output, api_name=\"addition\")\n</code></pre></div>\n\n<p>This will add and document the endpoint <code>/api/addition/</code> to the automatically generated API page. Otherwise, your API endpoints will appear as \"unnamed\" endpoints. </p>\n\n<p><em>Note</em>: For Gradio apps in which <a rel=\"noopener\" target=\"_blank\" href=\"https://gradio.app/guides/key-features#queuing\">queueing is enabled</a>, users can bypass the queue if they make a POST request to your API endpoint. To disable this behavior, set <code>api_open=False</code> in the <code>queue()</code> method. To disable the API page altogether, set <code>show_api=False</code> in <code>.launch()</code>.</p>\n\n<h2 id=\"authentication\">Authentication</h2>\n\n<p>You may wish to put an authentication page in front of your app to limit who can open your app. With the <code>auth=</code> keyword argument in the <code>launch()</code> method, you can provide a tuple with a username and password, or a  list of acceptable username/password tuples;  Here's an example that provides password-based authentication for a single user named \"admin\":</p>\n\n<div class='codeblock'><pre><code class='lang-python'>demo.launch(auth=(\"admin\", \"pass1234\"))\n</code></pre></div>\n\n<p>For more complex authentication handling, you can even pass a function that takes a username and password as arguments, and returns True to allow authentication, False otherwise. This can be used for, among other things, making requests to 3rd-party authentication services.</p>\n\n<p>Here's an example of a function that accepts any login where the username and password are the same:</p>\n\n<div class='codeblock'><pre><code class='lang-python'>def same_auth(username, password):\n    return username == password\ndemo.launch(auth=same_auth)\n</code></pre></div>\n\n<p>For authentication to work properly, third party cookies must be enabled in your browser.\nThis is not the case by default for Safari, Chrome Incognito Mode.</p>\n\n<h2 id=\"accessing-the-network-request-directly\">Accessing the Network Request Directly</h2>\n\n<p>When a user makes a prediction to your app, you may need the underlying network request, in order to get the request headers (e.g. for advanced authentication), log the client's IP address, or for other reasons. Gradio supports this in a similar manner to FastAPI: simply add a function parameter whose type hint is <code>gr.Request</code> and Gradio will pass in the network request as that parameter. Here is an example:</p>\n\n<div class='codeblock'><pre><code class='lang-python'>import gradio as gr\n\ndef echo(name, request: gr.Request):\n    if request:\n        print(\"Request headers dictionary:\", request.headers)\n        print(\"IP address:\", request.client.host)\n    return name\n\nio = gr.Interface(echo, \"textbox\", \"textbox\").launch()\n</code></pre></div>\n\n<p>Note: if your function is called directly instead of through the UI (this happens, for \nexample, when examples are cached), then <code>request</code> will be <code>None</code>. You should handle\nthis case explicitly to ensure that your app does not throw any errors. That is why\nwe have the explicit check <code>if request</code>.</p>\n\n<h2 id=\"mounting-within-another-fastapi-app\">Mounting Within Another FastAPI App</h2>\n\n<p>In some cases, you might have an existing FastAPI app, and you'd like to add a path for a Gradio demo.\nYou can easily do this with <code>gradio.mount_gradio_app()</code>.</p>\n\n<p>Here's a complete example:</p>\n\n<div class='codeblock'><pre><code class='lang-python'>from fastapi import FastAPI\nimport gradio as gr\n\nCUSTOM_PATH = \"/gradio\"\n\napp = FastAPI()\n\n\n@app.get(\"/\")\ndef read_main():\n    return {\"message\": \"This is your main app\"}\n\n\nio = gr.Interface(lambda x: \"Hello, \" + x + \"!\", \"textbox\", \"textbox\")\napp = gr.mount_gradio_app(app, io, path=CUSTOM_PATH)\n\n\n# Run this from the terminal as you would normally start a FastAPI app: `uvicorn run:app`\n# and navigate to http://localhost:8000/gradio in your browser.\n\n</code></pre></div>\n\n<p>Note that this approach also allows you run your Gradio apps on custom paths (<code>http://localhost:8000/gradio</code> in the example above).</p>\n\n<h2 id=\"security-and-file-access\">Security and File Access</h2>\n\n<p>Sharing your Gradio app with others (by hosting it on Spaces, on your own server, or through temporary share links) <strong>exposes</strong> certain files on the host machine to users of your Gradio app. </p>\n\n<p>In particular, Gradio apps ALLOW users to access to three kinds of files:</p>\n\n<ul>\n<li><p><strong>Files in the same directory (or a subdirectory) of where the Gradio script is launched from.</strong> For example, if the path to your gradio scripts is <code>/home/usr/scripts/project/app.py</code> and you launch it from <code>/home/usr/scripts/project/</code>, then users of your shared Gradio app will be able to access any files inside <code>/home/usr/scripts/project/</code>. This is done so that you can easily reference these files in your Gradio app (e.g. for your app's <code>examples</code>).</p></li>\n<li><p><strong>Temporary files created by Gradio.</strong> These are files that are created by Gradio as part of running your prediction function. For example, if your prediction function returns a video file, then Gradio will save that video to a temporary file and then send the path to the temporary file to the front end. You can customize the location of temporary files created by Gradio by setting the environment variable <code>GRADIO_TEMP_DIR</code> to an absolute path, such as <code>/home/usr/scripts/project/temp/</code>.</p></li>\n<li><p><strong>Files that you explicitly allow via the <code>allowed_paths</code> parameter in <code>launch()</code></strong>. This parameter  allows you to pass in a list of additional directories or exact filepaths you'd like to allow users to have access to. (By default, this parameter is an empty list).</p></li>\n</ul>\n\n<p>Gradio DOES NOT ALLOW access to:</p>\n\n<ul>\n<li><p><strong>Dotfiles</strong> (any files whose name begins with <code>'.'</code>) or any files that are contained in any directory whose name begins with <code>'.'</code></p></li>\n<li><p><strong>Files that you explicitly allow via the <code>blocked_paths</code> parameter in <code>launch()</code></strong>. You can pass in a list of additional directories or exact filepaths to the <code>blocked_paths</code> parameter in <code>launch()</code>. This parameter takes precedence over the files that Gradio exposes by default or by the <code>allowed_paths</code>.</p></li>\n<li><p><strong>Any other paths on the host machine</strong>. Users should NOT be able to access other arbitrary paths on the host. </p></li>\n</ul>\n\n<p>Please make sure you are running the latest version of <code>gradio</code> for these security settings to apply. </p>\n", "tags": [], "spaces": [], "url": "/guides/sharing-your-app/", "contributor": null}}